jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver_dma_support.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <string.h>
#include "fsl_dspi_common.h"
#include "fsl_dspi_master_driver.h"
#include "fsl_dspi_shared_function.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

/* For storing DMA intermediate buffers between the source buffer and TX FIFO */
static uint32_t s_cmdData;      /* Intermediate 16-bit command and 16-bit data buffer */
static uint32_t s_lastCmdData;  /* Consists of the last command and the final source data */
static uint16_t s_wordToSend; /* Word to send, if no send buffer, this variable is used
                                 as the word to send, which should be initialized to 0. Needs
                                 to be static and stored in data section as this variable
                                 address is the source address if no source buffer.  */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
dspi_status_t DSPI_DRV_MasterStartTransferDma(uint32_t instance,
                                              const dspi_device_t * restrict device);

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_MasterInitDma
 * Description   : Initialize a DSPI instance for master mode operation with DMA support.
 * This function is exactly like the dspi_master_init function but in addition, adds DMA support.
 * If the user desires to use DMA based transfers, then the user should use this function call
 * instead of the dspi_master_init function call.  Like the dspi_master_init,
 * this function initializes the run-time state structure to track the ongoing
 * transfers, ungates the clock to the DSPI module, resets the DSPI module, initializes the module
 * to user defined settings and default settings, configures the IRQ state structure, enables
 * the module-level interrupt to the core, and enables the DSPI module.
 * The CTAR parameter is special in that it allows the user to have different SPI devices
 * connected to the same DSPI module instance in addition to different peripheral chip
 * selects. Each CTAR contains the bus attributes associated with that particular SPI device.
 * For most use cases where only one SPI device is connected per DSPI module
 * instance, use CTAR0.
 * This is an example to set up the dspi_master_state_t and the
 * dspi_master_user_config_t parameters and to call the dspi_master_init function by passing
 * in these parameters:
 *   dspi_master_state_t dspiMasterState; <- the user simply allocates memory for this struct
 *    uint32_t calculatedBaudRate;
 *    dspi_master_user_config_t userConfig; <- the user fills out members for this struct
 *    userConfig.isChipSelectContinuous = false;
 *    userConfig.isSckContinuous = false;
 *    userConfig.pcsPolarity = kDspiPcs_ActiveLow;
 *    userConfig.whichCtar = kDspiCtar0;
 *    userConfig.whichPcs = kDspiPcs0;
 *    edma_software_tcd_t stcdSrc2CmdDataLast; <- needs to be aligned to a 32-byte boundary
 *    dspi_master_init(masterInstance, &dspiMasterState, &userConfig, &calculatedBaudRate
 *                     &stcdSrc2CmdDataLast);
 *
 * This init function also configures the eDMA module by requesting channels for DMA operation
 * and sets a "use_dma" flag in the run-time state structure to notify transfer functions
 * to use DMA driven operations.
 *
 * Note: The pointer param "stcdSrc2CmdDataLast" needs to be aligned to a 32-byte boundary.
 *       Also note, the only DSPI instance supported for DMA based operation is instnace 0.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_MasterInitDma(uint32_t instance,
                                   dspi_master_state_t * dspiState,
                                   const dspi_master_user_config_t * userConfig,
                                   edma_software_tcd_t * stcdSrc2CmdDataLast)
{
    dspi_status_t errorCode = kStatus_DSPI_Success;

    errorCode = DSPI_DRV_MasterInit(instance, dspiState, userConfig);

