jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver_dma_support.c
    /* Set the DSPI run-time state struct flag to indicate it will use the DMA */
    dspiState->useDma = true;

    /***********************************
     * Request DMA channels for RX FIFO
     ***********************************/
    /* This channel transfers data from RX FIFO to receiveBuffer */
    EDMA_DRV_RequestChannel(kEDMAAnyChannel, kDmaRequestMux0SPI0Rx,&dspiState->dmaFifo2Receive);

   /***********************************
     * Request DMA channels for TX FIFO
     ***********************************/
    /* "Channel 1" Intermediate command/data to TX FIFO (PUSHR).
     * Note, actual channel number may very depending on DMA system usage.
     * Only use DSPI instance 0 since it has a dedicated RX and TX DMA mux source
     */
    EDMA_DRV_RequestChannel(kEDMAAnyChannel, kDmaRequestMux0SPI0Tx, &dspiState->dmaCmdData2Fifo);

    /* "Channel 2" Source buffer to intermediate command/data
     * Note, actual channel number may very depending on DMA system usage.
     */
    EDMA_DRV_RequestChannel(kEDMAAnyChannel, kDmaRequestMux0AlwaysOn63, &dspiState->dmaSrc2CmdData);

    /**************************************************************************************
     * Update run-time state struct with the pointer to Software Transfer Control Descriptor
     **************************************************************************************/
    dspiState->stcdSrc2CmdDataLast = stcdSrc2CmdDataLast;

    return errorCode;
}

/*!
 * @brief Initiate (start) a transfer using DMA. This is not a public API as it is called from
 *  other driver functions
 */
dspi_status_t DSPI_DRV_MasterStartTransferDma(uint32_t instance,
                                             const dspi_device_t * restrict device)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];
    /* For temporarily storing DMA instance and channel */
    uint32_t dmaInstance, dmaChannel;
    uint32_t calculatedBaudRate;
    dspi_command_config_t command;  /* create an instance of the data command struct*/
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* Initialize s_wordToSend */
    s_wordToSend = 0;

    /* If the transfer count is zero, then return immediately.*/
    if (dspiState->remainingSendByteCount == 0)
    {
        /* Signal the synchronous completion object if the transfer wasn't async.
         * Otherwise, when we return the the sync function we'll get stuck in the sync wait loop.
         */
        if (!dspiState->isTransferAsync)
        {
            OSA_SemaPost(&dspiState->irqSync);
        }

        return kStatus_DSPI_Success;
    }

    /* Check that we're not busy.*/
    if (dspiState->isTransferInProgress)
    {
        return kStatus_DSPI_Busy;
    }

    /* Configure bus for this device. If NULL is passed, we assume the caller has
     * preconfigured the bus using DSPI_DRV_MasterConfigureBus().
     * Do nothing for calculatedBaudRate. If the user wants to know the calculatedBaudRate
     * then they can call this function separately.
     */
    if (device)
    {
        DSPI_DRV_MasterConfigureBus(instance, device, &calculatedBaudRate);
        dspiState->bitsPerFrame = device->dataBusConfig.bitsPerFrame;/*update dspiState bits/frame*/
    }

    /* Check the transfer byte count. If bits/frame > 8, meaning 2 bytes, then
     * the transfer byte count must not be an odd count, if so, drop the last odd byte.
     * Perform this operation here to ensure we get the latest bits/frame setting.
     */
    if (dspiState->bitsPerFrame > 8)
    {
        dspiState->remainingSendByteCount &= ~1UL;
        dspiState->remainingReceiveByteCount &= ~1UL;
    }

    /* Save information about the transfer for use by the ISR.*/
    dspiState->isTransferInProgress = true;

    /* Enable the DSPI module for the duration of this transfer.*/
    DSPI_HAL_Enable(baseAddr);

    /* Reset the transfer counter to 0. Normally this is done via the PUSHR[CTCNT], but as we
     * are under DMA controller, we won't be able to change this bit dynamically after the
     * first word is transferred.
     */
    DSPI_HAL_PresetTransferCount(baseAddr, 0);

    /* flush the fifos*/
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    /* Clear the EOQ flag as it may have been set from a previous transfer. Also, make sure
     * to do this after flushing the FIFOs.
     */
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiEndOfQueue);

    /* Enable the End Of Queue interrupt, which will set when DSPI sees EOQ bit set in the
     * last data word being sent. The ISR should clear this flag.
     */
    DSPI_HAL_SetIntMode(baseAddr, kDspiEndOfQueue, true);

    /* Each DMA channel's CSR[DONE] bit may be set if a previous transfer occurred.  The DONE
     * bit, as the name implies, sets when the channel is finished (completed it's MAJOR
     * LOOP). The DONE needs to be cleared before programming the channel's TCDs for the next
     * transfer.
     */
    dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaCmdData2Fifo.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaCmdData2Fifo.channel);
    EDMA_HAL_ClearDoneStatusFlag(dmaInstance, (edma_channel_indicator_t)dmaChannel);

    dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaSrc2CmdData.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaSrc2CmdData.channel);
    EDMA_HAL_ClearDoneStatusFlag(dmaInstance, (edma_channel_indicator_t)dmaChannel);

    dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaFifo2Receive.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaFifo2Receive.channel);
    EDMA_HAL_ClearDoneStatusFlag(dmaInstance, (edma_channel_indicator_t)dmaChannel);

    /************************************************************************************
     * Set up the RX DMA channel Transfer Control Descriptor (TCD)
     * Do this before filling the TX FIFO.
     * Note, if there is no receive buffer (if user passes in NULL), then bypass RX DMA
     * set up.
     ***********************************************************************************/
    /* If a receive buffer is used */
    if (dspiState->receiveBuffer)
    {
        /* For each transfer control descriptor set up, save off DMA instance and channel number
         * to simplified variable names to make code cleaner
         */
        dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaFifo2Receive.channel);
        dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaFifo2Receive.channel);

