jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver_dma_support.c
        /* Source addr, RX FIFO */
        EDMA_HAL_HTCDSetSrcAddr(dmaInstance,dmaChannel, HW_SPI_POPR_ADDR(baseAddr));

        /* Source addr offset is 0 as source addr never increments */
        EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 0);

        /* The source and destination attributes (bit size) depends on bits/frame setting */
        if (dspiState->bitsPerFrame <= 8)
        {
            /* Source size is one byte, destination size is one byte */
            EDMA_HAL_HTCDSetAttribute(
                dmaInstance, dmaChannel,
                kEDMAModuloDisable, kEDMAModuloDisable,
                kEDMATransferSize_1Bytes,kEDMATransferSize_1Bytes);

            /* Transfer 1 byte from RX FIFO to receive buffer */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 1);
        }
        else /* For 16-bit words, but the receive buffer is still an 8-bit buffer */
        {

            /* Source size is 2 byte, destination size is one byte */
            EDMA_HAL_HTCDSetAttribute(
                dmaInstance, dmaChannel,
                kEDMAModuloDisable, kEDMAModuloDisable,
                kEDMATransferSize_2Bytes,kEDMATransferSize_1Bytes);

            /* Transfer 2 bytes from RX FIFO to receive buffer */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 2);
        }

        /* Don't increment source address, it is constant */
        EDMA_HAL_HTCDSetSrcLastAdjust(dmaInstance, dmaChannel, 0);

        /* Destination is the receive buffer */
        EDMA_HAL_HTCDSetDestAddr(dmaInstance, dmaChannel,(uint32_t)(dspiState->receiveBuffer));

        /* Dest addr offset, increment to the next byte */
        EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 1);

        /* Set MAJOR count to remaining receive byte count. Configure both the
         * CITER and BITER fields.  Also, clear the ELINK field (disable channel linking)
         */
        EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel, 0, false);
        EDMA_HAL_HTCDSetMajorCount(dmaInstance, dmaChannel,
                                   (uint32_t)dspiState->remainingReceiveByteCount);

        /* No adjustment needed for destination addr */
        EDMA_HAL_HTCDSetDestLastAdjust(dmaInstance,dmaChannel, 0);

        /* Now that TCD was set up, enable the DSPI Peripheral Hardware request for the RX FIFO */
        EDMA_HAL_SetDmaRequestCmd(dmaInstance,(edma_channel_indicator_t)dmaChannel,true);

        /* Enable the Receive FIFO Drain Request  as a DMA request */
        DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, true);
    }

    /************************************************************************************
     * Set up the Last Command/data Word Intermediate Buffer and fill up the TX FIFO.
     ***********************************************************************************/
    /* Before sending the data, we first need to initialize the data command struct
     * Configure the data command attributes for the desired PCS, CTAR, and continuous PCS
     * which are derived from the run-time state struct
     */
    command.whichPcs = dspiState->whichPcs;
    command.whichCtar = dspiState->whichCtar;
    command.isChipSelectContinuous = dspiState->isChipSelectContinuous;

    /************************************************************************
     * Next, set up the Last Command/data Word Intermediate Buffer before
     * filling up the TX FIFO
     * Create a 32-bit word with the final 16-bit command settings. This means
     * that EOQ = 1 and CONT = 0.
     * This 32-bit word will also be initialized with the final data byte/word
     * from the send source buffer and then the entire 32-bit word will be
     * transferred to the DSPI PUSHR.
     ************************************************************************/
    /* Store the original transferByteCount before remainingSendByteCount is decremented
     * and declare a variable for storing the last send data (either 8- or 16-bit).
     */
    uint32_t transferByteCount = dspiState->remainingSendByteCount;
    uint32_t lastWord = 0;

    /* If a send buffer was provided, the word comes from there. Otherwise we just send
     * a zero (initialized above).
     */
    if (dspiState->sendBuffer)
    {
        /* Store the last byte from the send buffer */
        if (dspiState->bitsPerFrame <= 8)
        {
            lastWord = dspiState->sendBuffer[transferByteCount-1]; /* Last byte */
        }
        /* Store the last two bytes the send buffer */
        else
        {
            lastWord = dspiState->sendBuffer[transferByteCount-1] ; /* Save off the last byte */
            lastWord = lastWord << 8U; /* Shift to MSB (separate step due to MISHA) */
            lastWord |= dspiState->sendBuffer[transferByteCount-2]; /* OR with next to last byte */
        }
    }

    /* Now, build the last command/data word intermediate buffer */
    command.isChipSelectContinuous = false; /* Always clear CONT for last data word */
    command.isEndOfQueue = true; /* Set EOQ for last data word */
    s_lastCmdData = BF_SPI_PUSHR_CONT(command.isChipSelectContinuous) |
                    BF_SPI_PUSHR_CTAS(command.whichCtar) |
                    BF_SPI_PUSHR_PCS(command.whichPcs) |
                    BF_SPI_PUSHR_EOQ(command.isEndOfQueue) |
                    BF_SPI_PUSHR_TXDATA(lastWord); /* last byte/word in send buffer */

    /************************************************************************
     * Begin TX DMA channels transfer control descriptor set up.
     * 1. First, set up intermediate buffers which contain 16-bit commands.
     * 2. Set up the DMA Software Transfer Control Descriptors (STCD) for various
     *    scenarios:
     *    - Channel for intermediate buffer to TX FIFO
     *    - Channel for source buffer to intermediate buffer
     *    - STCD for scatter/gather for end of previous channel to replace
     *      intermediate buffer with last-command buffer.
     ************************************************************************/

    /************************************************************************
     * Intermediate Buffer
     * Create a 32-bit word with the 16-bit command settings. Data from
     * the send source buffer will be transferred here and then the entire
     * 32-bit word will be transferred to the DSPI PUSHR.
     * This buffer will be preloaded with the next data word in the send buffer
     ************************************************************************/
    command.isEndOfQueue = 0; /* Clear End of Queue (previously set for last cmd/data word)*/
    s_cmdData = BF_SPI_PUSHR_CONT(command.isChipSelectContinuous) |
                BF_SPI_PUSHR_CTAS(command.whichCtar) |
                BF_SPI_PUSHR_PCS(command.whichPcs) |
                BF_SPI_PUSHR_EOQ(command.isEndOfQueue);

    /* Place the next data from the send buffer into the intermediate buffer (preload it)
     * based on whether it is one byte or two.
     */
    if (dspiState->bitsPerFrame <= 8)
    {
        /* If a send buffer was provided, the word comes from there. Otherwise we just send
         * a zero (initialized above).
         */
        if (dspiState->sendBuffer)
        {
            s_wordToSend = *(dspiState->sendBuffer);  /* queue up the next data */
            ++dspiState->sendBuffer; /* increment to next data word*/
        }
        --dspiState->remainingSendByteCount; /* decrement remainingSendByteCount*/
    }
    else
    {
        /* If a send buffer was provided, the word comes from there. Otherwise we just send
         * a zero (initialized above).
         */
        if (dspiState->sendBuffer)
        {
            s_wordToSend = *(dspiState->sendBuffer);
            ++dspiState->sendBuffer; /* increment to next data byte */
            s_wordToSend |= (unsigned)(*(dspiState->sendBuffer)) << 8U;
            ++dspiState->sendBuffer; /* increment to next data byte */
        }
        dspiState->remainingSendByteCount -= 2; /* decrement remainingSendByteCount by 2 */
    }

    s_cmdData |= BF_SPI_PUSHR_TXDATA(s_wordToSend); /* write s_wordToSend to intermediate buffer */

    /************************************************************************************
     * Transfer Control Descriptor set up for Intermediate command/data to TX
     * FIFO (PUSHR). AKA "Channel 1"
     * Note, actual channel number may very depending on DMA system usage.
     * This channels links to "Channel 1" on completion of MAJOR loop.  "Channel 1" is
     * the channel that transfers data from the send source buffer to the intermediate
     * command/data buffer.
     * Note that the channel linking is based on the MAJOR loop complete and not on minor
     * loop.  This is because we are only sending one 32-bit word so when the minor loop
     * completes, the MAJOR loop also completes.  The eDMA does not channel link on the
     * last iteration of the MAJOR loop using the ELINK mechanism, hence we have to link
     * on the MAJOR loop completion using MAJORLINK channel linking.
     ************************************************************************************/
    /* For each transfer control descriptor set up, save off DMA instance and channel number
     * to simplified variable names to make code cleaner
     */
    dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaCmdData2Fifo.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaCmdData2Fifo.channel);

    /* If remainingSendByteCount is 0, then send last command/data since this is the
     * last data word to send
     */
    if (dspiState->remainingSendByteCount == 0)
    {
        /* Source address is the last command/data intermediate buffer */
        EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,(uint32_t)(&s_lastCmdData));

