jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver_dma_support.c
        /* Disable ERQ request at end of major count */
        EDMA_HAL_HTCDSetDisableDmaRequestAfterTCDDoneCmd(dmaInstance, dmaChannel, true);

        /* Disable majorlink request */
        EDMA_HAL_HTCDSetChannelMajorLink(dmaInstance, dmaChannel, 0, false);
    }
    /* Else, send the intermediate buffer  */
    else
    {
        /* Source addr, intermediate command/data*/
        EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,(uint32_t)(&s_cmdData));

        /* Set the MAJOR link channel to link the the next channel that will pull data from
         * the source buffer into the intermediate command/data buffer and enable MAJOR link
         */
        EDMA_HAL_HTCDSetChannelMajorLink(dmaInstance, dmaChannel,
                        VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaSrc2CmdData.channel), true);

        /* Do not disable ERQ request at end of major count */
        EDMA_HAL_HTCDSetDisableDmaRequestAfterTCDDoneCmd(dmaInstance, dmaChannel, false);
    }

    /* Source addr offset is 0 as source addr never increments */
    EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 0);

    /* source size 32-bits */
    /* destination size 32bits*/
    /* Clear the SMOD and DMOD fields */
    EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                              kEDMAModuloDisable, kEDMAModuloDisable,
                              kEDMATransferSize_4Bytes, kEDMATransferSize_4Bytes);

    /* Transfer 4 bytes or one word */
    EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 4);

    /* Don't increment source address, it is constant */
    EDMA_HAL_HTCDSetSrcLastAdjust(dmaInstance, dmaChannel, 0);

    /* Destination is SPI PUSHR TX FIFO */
    EDMA_HAL_HTCDSetDestAddr(dmaInstance, dmaChannel, HW_SPI_PUSHR_ADDR(baseAddr));

    /* No dest addr offset, since we never increment the dest addr */
    EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 0);

    /* We are only sending one 32-bit word, so MAJOR count is "1". Do not use "ELINK"
     * to link channels, use MAJORLINK in CSR, therefore disable minor link (ELINK=0)
     */
    EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel, 0, false);
    EDMA_HAL_HTCDSetMajorCount(dmaInstance, dmaChannel, 1);

    /* No adjustment needed for destination addr or scatter/gather */
    EDMA_HAL_HTCDSetScatterGatherCmd(dmaInstance, dmaChannel, false);

    /* Implement the following DMA channel set up only if we still have data yet to send
     * Otherwise, bypass this and enable the DSPI Transmit DMA request.
     */
    dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaSrc2CmdData.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaSrc2CmdData.channel);

    if (dspiState->remainingSendByteCount != 0)
    {
        /************************************************************************************
         * Scatter/gather STCD set up
         * STCD ONLY for Last intermediate command/data to PUSHR. Do not call
         * edma_hal_stcd_push_to_htcd as this is used for "Channel 2" scatter/gather.
         * Hence we will call this "Channel 2 prime". This needs to be defined before
         * setting up "Channel 2" as it needs the address for this STCD.
         *
         * IMPORTANT: Per eDMA spec, the pointer address for this STCD structure needs to be
         *            aligned on 32-byte boundaries.
         ************************************************************************************/
        /* Source addr is last data + last command */
        dspiState->stcdSrc2CmdDataLast->SADDR = (uint32_t)(&s_lastCmdData);

        /* Source addr offset is 0 as source addr never increments */
        dspiState->stcdSrc2CmdDataLast->SOFF = 0;

        dspiState->stcdSrc2CmdDataLast->ATTR =
            (2 << BP_DMA_TCDn_ATTR_SSIZE) | /* source size 32-bits */
            (2 << BP_DMA_TCDn_ATTR_DSIZE);  /* destination size 32bits*/

        /* Transfer 4 bytes or one word */
        dspiState->stcdSrc2CmdDataLast->NBYTES.MLNO = 4;

        /* Don't increment source address, it is constant */
        dspiState->stcdSrc2CmdDataLast->SLAST = 0;

        /* Destination is the intermediate command/data buffer. Overwrite it with last data word */
        dspiState->stcdSrc2CmdDataLast->DADDR = (uint32_t)(&s_cmdData);

        /* No dest addr offset since we never increment the dest addr */
        dspiState->stcdSrc2CmdDataLast->DOFF = 0;

        /* We are only sending one 32-bit word, so MAJOR count is "1", no chan-to-chan linking */
        dspiState->stcdSrc2CmdDataLast->CITER.ELINKYES = 1; /* major count only */
        dspiState->stcdSrc2CmdDataLast->BITER.ELINKYES = 1; /* major count only */

        /* No adjustment needed for destination addr */
        dspiState->stcdSrc2CmdDataLast->DLAST_SGA = 0;

        /* CSR set up */
        dspiState->stcdSrc2CmdDataLast->CSR =
                              (1 << BP_DMA_TCDn_CSR_DREQ) | /* Disable ERQ request when CITER=0 */
                              (0 << BP_DMA_TCDn_CSR_ESG);   /* clr the ESG */

        /* If at this point we are left with only sending one more data byte/word, then this
         * is the last command/data to send.  So the transfer control descriptor should move the
         * last command/data word into the intermediate buffer and this will get transferred to the
         * DSPI when the FIFO is ready for this.
         */
        if (((dspiState->bitsPerFrame <= 8) && ((dspiState->remainingSendByteCount-1) == 0)) ||
            ((dspiState->bitsPerFrame > 8) && ((dspiState->remainingSendByteCount-2) == 0)))
        {
            /* push the contents of the SW TCD to the HW TCD registers */
            EDMA_HAL_PushSTCDToHTCD(dmaInstance, dmaChannel, dspiState->stcdSrc2CmdDataLast);
        }
        /* Otherwise, we are left with more data to send, so use the transfer control
         * descriptor that will move data from the send source buffer to the intermediate
         * command/data buffer.
         */
        else
        {
            /************************************************************************************
             * Transfer Control Descriptor set up for Source buffer to intermediate
             * command/data (this is a linked channel). AKA "Channel 2"
             * Note, actual channel number may very depending on DMA system usage
             * This channel is triggered by the completion of "Channel 1". It transfers data from
             * the send source buffer to the intermediate command/data word. When the source
             * buffer transfers the word before the last data word, the MAJOR loop completes
             * and triggers the scatter/gather (ESG = 1) and loads the STCD that is set up to
             * transfer the last command/data word to the PUSHR.
             ************************************************************************************/

            /* If a send buffer was provided, the word comes from there. Otherwise we set
             * the source address to point to the s_wordToSend variable that was set to 0.
             */
            if (dspiState->sendBuffer)
            {
                /* Source addr is the "send" data buffer */
                EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,
                                        (uint32_t)(dspiState->sendBuffer));
                /* Increment the source address by one byte after every transfer */
                EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 1);
            }
            else
            {
                /* Source addr is the "send" data buffer */
                EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,
                                        (uint32_t)(&s_wordToSend));
                /* Don't increment the source address  */
                EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 0);
            }

            if (dspiState->bitsPerFrame <= 8)
            {
                /* Source and destination size: byte */
                EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                            kEDMAModuloDisable, kEDMAModuloDisable,
                            kEDMATransferSize_1Bytes, kEDMATransferSize_1Bytes);

                /* minor byte transfer: 1 byte (8-bit word) */
                EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 1);

