jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver_dma_support.c
                /* Major loop count is equal to remaining number of bytes to send minus 1.
                 * That is because the last data byte/word is written to the last command/data
                 * intermediate buffer.
                 * Also, disable minor link (ELINK=0)
                 */
                EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel, 0, false);
                EDMA_HAL_HTCDSetMajorCount(
                            dmaInstance, dmaChannel, (dspiState->remainingSendByteCount-1));

            }
            else
            {
                /* Source size: byte and destination size: halfword */
                EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                            kEDMAModuloDisable, kEDMAModuloDisable,
                            kEDMATransferSize_1Bytes, kEDMATransferSize_2Bytes);

                /* minor byte transfer: 2 bytes (16-bit word) */
                EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 2);

                /* Major loop count is equal to remaining number of 16-bit words to send
                 * hence need to convert remainingSendByteCount from byte to 16-bit word
                 * Also, disable minor link (ELINK=0)
                 */
                EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel, 0, false);
                EDMA_HAL_HTCDSetMajorCount(
                            dmaInstance, dmaChannel, (dspiState->remainingSendByteCount-2)/2);

            }

            /* Set SLAST to 0 */
            EDMA_HAL_HTCDSetSrcLastAdjust(dmaInstance, dmaChannel, 0);

            /* Destination addr, intermediate command/data */
            EDMA_HAL_HTCDSetDestAddr(dmaInstance, dmaChannel,(uint32_t)(&s_cmdData));

            /* No dest addr offset, since we never increment the dest addr */
            EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 0);

            /* Place the address of the scatter/gather in order to reload STCD for the final
             * last command/data word to be loaded to the intermediate buffer.
             * IMPORTANT: This address needs to be 32-byte aligned.
             */
            EDMA_HAL_HTCDSetScatterGatherLink(dmaInstance, dmaChannel,
                                    (edma_software_tcd_t *)(dspiState->stcdSrc2CmdDataLast));
        }
    }

    /* Now that the TCD was set up for each channel, enable the DSPI
     * Peripheral Hardware request for the first DMA channel, dmaSrc2CmdData
     */
    dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaCmdData2Fifo.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaCmdData2Fifo.channel);

    EDMA_HAL_SetDmaRequestCmd(dmaInstance, (edma_channel_indicator_t)dmaChannel,true);

    /* Enable TFFF request in the DSPI module */
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, true);

    return kStatus_DSPI_Success;
}
/*******************************************************************************
 * EOF
 ******************************************************************************/

